{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/francisco/Documents/umich/coursework/semester_2/pubpol_639/assignments/ps4/ps4.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}22 Mar 2024, 23:38:03
{txt}
{com}. //_1
. display c(current_date)
{res}22 Mar 2024
{txt}
{com}. //_2q
. // this is the stata code 
. use unions4.dta, clear
{txt}
{com}. gen agesquared = age^2
{txt}
{com}. gen empsize_union = empsize*union
{txt}
{com}. gen health_union  = ind_health*union
{txt}
{com}. quietly regress lnwage age union empsize ind_retail ind_personal ind_health ind_educ, robust
{txt}
{com}. eststo col1, title(model 1)
{txt}
{com}. quietly regress lnwage age agesquared union empsize ind_retail ind_personal ind_health ind_educ, robust
{txt}
{com}. eststo col2, title(model 2)
{txt}
{com}. quietly regress lnwage age agesquared union empsize empsize_union ind_retail ind_personal ind_health ind_educ, robust
{txt}
{com}. eststo col3, title(model 3)
{txt}
{com}. quietly regress lnwage age agesquared union empsize health_union ind_retail ind_personal ind_health ind_educ, robust
{txt}
{com}. eststo col4, title(model 4)
{txt}
{com}. estout col1 col2 col3 col4, cells(b (star fmt(3)) se(par fmt(2))) starlevels(* 0.10 ** 0.05 *** 0.01) legend stats(r2_a r2 N, labels("Adj. R-Squared" "R-Squared" "Observations")) label collabels("") 
{res}
{txt}{hline 84}
{txt}                          model 1         model 2         model 3         model 4   
{txt}                                                                                    
{txt}{hline 84}
{txt}Age                 {res}        0.006***        0.046***        0.046***        0.046***{txt}
                    {res}       (0.00)          (0.01)          (0.01)          (0.01)   {txt}
{txt}= 1 if in or cover~n{res}        0.139***        0.120***        0.271***        0.116** {txt}
                    {res}       (0.04)          (0.04)          (0.10)          (0.05)   {txt}
{txt}Firm size           {res}        0.011***        0.010***        0.012***        0.010***{txt}
                    {res}       (0.00)          (0.00)          (0.00)          (0.00)   {txt}
{txt}ind_retail          {res}       -0.432***       -0.409***       -0.409***       -0.410***{txt}
                    {res}       (0.05)          (0.05)          (0.05)          (0.05)   {txt}
{txt}ind_personal        {res}       -0.306***       -0.329***       -0.330***       -0.330***{txt}
                    {res}       (0.10)          (0.10)          (0.10)          (0.10)   {txt}
{txt}ind_health          {res}       -0.080          -0.099*         -0.097*         -0.102*  {txt}
                    {res}       (0.06)          (0.06)          (0.06)          (0.06)   {txt}
{txt}ind_educ            {res}       -0.149***       -0.137***       -0.144***       -0.138***{txt}
                    {res}       (0.05)          (0.05)          (0.05)          (0.05)   {txt}
{txt}agesquared          {res}                       -0.000***       -0.000***       -0.000***{txt}
                    {res}                       (0.00)          (0.00)          (0.00)   {txt}
{txt}empsize_union       {res}                                       -0.016*                  {txt}
                    {res}                                       (0.01)                   {txt}
{txt}health_union        {res}                                                        0.025   {txt}
                    {res}                                                       (0.13)   {txt}
{txt}_cons               {res}        2.516***        1.769***        1.764***        1.771***{txt}
                    {res}       (0.08)          (0.14)          (0.14)          (0.14)   {txt}
{txt}{hline 84}
{txt}Adj. R-Squared      {res}        0.183           0.213           0.215           0.212   {txt}
{txt}R-Squared           {res}        0.189           0.219           0.222           0.219   {txt}
{txt}Observations        {res}     1000.000        1000.000        1000.000        1000.000   {txt}
{txt}{hline 84}
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}.  
. //_3
. use teen_births, clear
{txt}
{com}. quietly regress teenbirth black hisp other head_educ frac_marr_parents familyincome, robust
{txt}
{com}. eststo col1, title(LPM)
{txt}
{com}. quietly logit teenbirth black hisp other head_educ frac_marr_parents familyincome, robust
{txt}
{com}. eststo col2, title(logit)
{txt}
{com}. quietly probit teenbirth black hisp other head_educ frac_marr_parents familyincome, robust
{txt}
{com}. eststo col3, title(probit)
{txt}
{com}. quietly logit teenbirth black hisp other head_educ frac_marr_parents familyincome, robust or
{txt}
{com}. eststo col4, title(odds)
{txt}
{com}. estout col1 col2 col3 col4, eform(0 0 0 1) cells(b(star fmt(3)) se(par fmt(2))) starlevels(* 0.10 ** 0.05 *** 0.01) legend stats(r2_a r2 N, labels("Adj. R-Squared" "R-Squared" "Observations")) label collabels("") 
{res}
{txt}{hline 84}
{txt}                              LPM           logit          probit            odds   
{txt}                                                                                    
{txt}{hline 84}
{res}main                                                                                {txt}
{txt}black               {res}        0.079***        0.555***        0.314***        1.742***{txt}
                    {res}       (0.01)          (0.10)          (0.05)          (0.17)   {txt}
{txt}hisp                {res}        0.071           0.648*          0.371**         1.911*  {txt}
                    {res}       (0.05)          (0.33)          (0.19)          (0.64)   {txt}
{txt}other               {res}       -0.019          -0.373          -0.188           0.688   {txt}
                    {res}       (0.05)          (0.75)          (0.37)          (0.51)   {txt}
{txt}head_educ           {res}       -0.015***       -0.078***       -0.045***        0.925***{txt}
                    {res}       (0.00)          (0.01)          (0.01)          (0.01)   {txt}
{txt}frac_marr_parents   {res}       -0.026**         0.055           0.031           1.057   {txt}
                    {res}       (0.01)          (0.09)          (0.05)          (0.09)   {txt}
{txt}familyincome        {res}       -0.000***       -0.018***       -0.009***        0.982***{txt}
                    {res}       (0.00)          (0.00)          (0.00)          (0.00)   {txt}
{txt}_cons               {res}        0.324***       -0.517***       -0.339***        0.596***{txt}
                    {res}       (0.03)          (0.20)          (0.11)          (0.12)   {txt}
{txt}{hline 84}
{txt}Adj. R-Squared      {res}        0.063                                                   {txt}
{txt}R-Squared           {res}        0.064                                                   {txt}
{txt}Observations        {res}     6616.000        6616.000        6616.000        6616.000   {txt}
{txt}{hline 84}
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}. 
. //_4
. quietly reg teenbirth black hisp other head_educ frac_marr_parents familyincome, robust
{txt}
{com}. predict predicted_values1
{txt}(option {bf:xb} assumed; fitted values)
(6 missing values generated)

{com}. sum predicted_values1 if predicted_values1 < 0 | predicted_values1 > 1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
predicted_~1 {c |}{res}        275   -.0410155    .0737929  -.8012976  -6.64e-06
{txt}
{com}. local fraction = r(N) / _N
{txt}
{com}. di `fraction'
{res}.04152824
{txt}
{com}. //_5
. quietly logit teenbirth black hisp other head_educ frac_marr_parents familyincome, robust
{txt}
{com}. predict predicted_values2
{txt}(option {bf:pr} assumed; Pr(teenbirth))
(6 missing values generated)

{com}. sum predicted_values2 if predicted_values2 < 0 | predicted_values2 > 1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
predicted_~2 {c |}{res}          0
{txt}
{com}. local fraction = r(N) / _N
{txt}
{com}. di `fraction'
{res}0
{txt}
{com}. //_6
. quietly probit teenbirth black hisp other head_educ frac_marr_parents familyincome, robust
{txt}
{com}. predict predicted_values3
{txt}(option {bf:pr} assumed; Pr(teenbirth))
(6 missing values generated)

{com}. sum predicted_values3 if predicted_values3 < 0 | predicted_values3 > 1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
predicted_~3 {c |}{res}          0
{txt}
{com}. local fraction = r(N) / _N
{txt}
{com}. di `fraction'
{res}0
{txt}
{com}. //_7
. quietly logit teenbirth black hisp other head_educ frac_marr_parents familyincome, robust
{txt}
{com}. margins, at(black=0 hisp=1 other=0 head_educ=12 frac_marr_parents= (.50 1) familyincome=25)
{res}
{txt}{col 1}Adjusted predictions{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:6,616}
{txt}{col 1}Model VCE: {res:Robust}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(teenbirth), predict()}{p_end}
{p2colreset}{...}
{lalign 7:1._at: }{space 0}{lalign 16:black} = {res:{ralign 2:0}}
{lalign 7:}{space 0}{lalign 16:hisp} = {res:{ralign 2:1}}
{lalign 7:}{space 0}{lalign 16:other} = {res:{ralign 2:0}}
{lalign 7:}{space 0}{lalign 16:head_educ} = {res:{ralign 2:12}}
{lalign 7:}{space 0}{lalign 16:frac_marr_pare~s} = {res:{ralign 2:.5}}
{lalign 7:}{space 0}{lalign 16:familyincome} = {res:{ralign 2:25}}
{lalign 7:2._at: }{space 0}{lalign 16:black} = {res:{ralign 2:0}}
{lalign 7:}{space 0}{lalign 16:hisp} = {res:{ralign 2:1}}
{lalign 7:}{space 0}{lalign 16:other} = {res:{ralign 2:0}}
{lalign 7:}{space 0}{lalign 16:head_educ} = {res:{ralign 2:12}}
{lalign 7:}{space 0}{lalign 16:frac_marr_pare~s} = {res:{ralign 2:1}}
{lalign 7:}{space 0}{lalign 16:familyincome} = {res:{ralign 2:25}}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}_at {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .2276324{col 26}{space 2} .0576313{col 37}{space 1}    3.95{col 46}{space 3}0.000{col 54}{space 4}  .114677{col 67}{space 3} .3405877
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .2325336{col 26}{space 2} .0585373{col 37}{space 1}    3.97{col 46}{space 3}0.000{col 54}{space 4} .1178026{col 67}{space 3} .3472646
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. di .2325336 - .2276324
{res}.0049012
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/francisco/Documents/umich/coursework/semester_2/pubpol_639/assignments/ps4/ps4.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}22 Mar 2024, 23:38:04
{txt}{.-}
{smcl}
{txt}{sf}{ul off}