{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/francisco/Documents/umich/coursework/semester_2/pubpol_639/assignments/ps6/ps6.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}19 Apr 2024, 21:53:45
{txt}
{com}. //_1
. display c(current_date)
{res}19 Apr 2024
{txt}
{com}. //_2q
. use age21mort.dta, clear
{txt}
{com}. * create variables 
. gen over21 = (agecell > 21)
{txt}
{com}. * center age
. gen age_centered = age - 21
{txt}
{com}. gen agesq  = age_centered^2
{txt}
{com}. *twoway scatter all agecell, xline(21) 
. twoway scatter all age_centered, xline(0) 
{res}{txt}
{com}. graph export all_age.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
all_age.png{rm}
saved as
PNG
format
{p_end}

{com}. //_3q
. * regressions
. qui reg all age_centered over21, r 
{txt}
{com}. eststo one, title(Reg. 1)
{txt}
{com}. qui reg all age_centered over21 c.age_centered#i.over21, r
{txt}
{com}. eststo two, title(Reg. 2)
{txt}
{com}. qui reg all over21 age_centered agesq c.age_centered#i.over21 c.agesq#i.over21, r
{txt}
{com}. eststo three, title(Reg. 3)
{txt}
{com}. qui reg all age_centered over21 c.age_centered#i.over21 if agecell >= 20 & agecell <= 22, r
{txt}
{com}. eststo four, title(Reg. 4)
{txt}
{com}. * output
. estout one two three four, cells(b (star fmt(3)) se(par fmt(2))) starlevels(* 0.10 ** 0.05 *** 0.01) legend stats(r2_a r2 N, labels("Adj. R-Squared" "R-Squared" "Observations")) label collabels("") 
{res}
{txt}{hline 84}
{txt}                           Reg. 1          Reg. 2          Reg. 3          Reg. 4   
{txt}                                                                                    
{txt}{hline 84}
{txt}age_centered        {res}       -0.975           0.827          -0.831          -1.612   {txt}
                    {res}       (0.66)          (0.72)          (2.85)          (2.28)   {txt}
{txt}over21              {res}        7.663***        7.663***        9.548***        9.753***{txt}
                    {res}       (1.51)          (1.27)          (1.83)          (1.90)   {txt}
{txt}over21=0 # age_cen~d{res}                        0.000           0.000           0.000   {txt}
                    {res}                          (.)             (.)             (.)   {txt}
{txt}over21=1 # age_cen~d{res}                       -3.603***       -6.017          -3.289   {txt}
                    {res}                       (1.12)          (4.53)          (3.73)   {txt}
{txt}agesq               {res}                                       -0.840                   {txt}
                    {res}                                       (1.54)                   {txt}
{txt}over21=0 # agesq    {res}                                        0.000                   {txt}
                    {res}                                          (.)                   {txt}
{txt}over21=1 # agesq    {res}                                        2.904                   {txt}
                    {res}                                       (2.26)                   {txt}
{txt}_cons               {res}       91.841***       93.618***       93.073***       92.524***{txt}
                    {res}       (0.71)          (0.63)          (0.78)          (0.86)   {txt}
{txt}{hline 84}
{txt}Adj. R-Squared      {res}        0.577           0.645           0.644           0.674   {txt}
{txt}R-Squared           {res}        0.595           0.668           0.682           0.716   {txt}
{txt}Observations        {res}       48.000          48.000          48.000          24.000   {txt}
{txt}{hline 84}
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}. //_4q
. qui reg all over21 age_centered agesq c.age_centered#i.over21 c.agesq#i.over21, r
{txt}
{com}. testparm agesq  i.over21#c.agesq

{p 0 7}{space 1}{text:( 1)}{space 1} {res}agesq = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} 1.over21#c.agesq = 0{p_end}

{txt}       F(  2,    42) ={res}    0.93
{txt}{col 13}Prob > F ={res}    0.4018
{txt}
{com}. //_5q
. * regressions
. qui reg mva over21 age_centered c.age_centered#i.over21, r
{txt}
{com}. eststo one, title(MVA)
{txt}
{com}. qui reg homicide over21 age_centered c.age_centered#i.over21, r
{txt}
{com}. eststo two, title(Homicide)
{txt}
{com}. qui reg suicide over21 age_centered c.age_centered#i.over21, r
{txt}
{com}. eststo three, title(Suicide)
{txt}
{com}. * output
. estout one two three, cells(b (star fmt(3)) se(par fmt(2))) starlevels(* 0.10 ** 0.05 *** 0.01) legend stats(r2_a r2 N, labels("Adj. R-Squared" "R-Squared" "Observations")) label collabels("") 
{res}
{txt}{hline 68}
{txt}                              MVA        Homicide         Suicide   
{txt}                                                                    
{txt}{hline 68}
{txt}over21              {res}        4.534***        0.104           1.794***{txt}
                    {res}       (0.68)          (0.37)          (0.49)   {txt}
{txt}age_centered        {res}       -2.568***        0.795***        0.029   {txt}
                    {res}       (0.38)          (0.26)          (0.18)   {txt}
{txt}over21=0 # age_cen~d{res}        0.000           0.000           0.000   {txt}
                    {res}          (.)             (.)             (.)   {txt}
{txt}over21=1 # age_cen~d{res}       -1.162**        -1.145***       -0.420   {txt}
                    {res}       (0.58)          (0.33)          (0.42)   {txt}
{txt}_cons               {res}       29.929***       17.425***       11.662***{txt}
                    {res}       (0.33)          (0.27)          (0.21)   {txt}
{txt}{hline 68}
{txt}Adj. R-Squared      {res}        0.703           0.332           0.453   {txt}
{txt}R-Squared           {res}        0.722           0.375           0.488   {txt}
{txt}Observations        {res}       48.000          48.000          48.000   {txt}
{txt}{hline 68}
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}. //_6q
. qui reg internal over21 age_centered, r 
{txt}
{com}. eststo one, title(Reg. 1)
{txt}
{com}. qui reg internal over21 age_centered c.age_centered#i.over21, r
{txt}
{com}. eststo two, title(Reg. 2)
{txt}
{com}. qui reg internal over21 age_centered agesq c.age_centered#i.over21 c.agesq#i.over21, r
{txt}
{com}. eststo three, title(Reg. 3)
{txt}
{com}. qui reg internal over21 age_centered c.age_centered#i.over21 if agecell >= 20 & agecell <= 22, r
{txt}
{com}. eststo four, title(Reg. 4)
{txt}
{com}. * output
. estout one two three four, cells(b (star fmt(3)) se(par fmt(2))) starlevels(* 0.10 ** 0.05 *** 0.01) legend stats(r2_a r2 N, labels("Adj. R-Squared" "R-Squared" "Observations")) label collabels("") 
{res}
{txt}{hline 84}
{txt}                           Reg. 1          Reg. 2          Reg. 3          Reg. 4   
{txt}                                                                                    
{txt}{hline 84}
{txt}over21              {res}        0.392           0.392           1.073           1.692** {txt}
                    {res}       (0.54)          (0.55)          (0.80)          (0.76)   {txt}
{txt}age_centered        {res}        1.600***        1.618***        1.500           0.164   {txt}
                    {res}       (0.25)          (0.34)          (1.34)          (0.90)   {txt}
{txt}over21=0 # age_cen~d{res}                        0.000           0.000           0.000   {txt}
                    {res}                          (.)             (.)             (.)   {txt}
{txt}over21=1 # age_cen~d{res}                       -0.036          -1.870          -0.348   {txt}
                    {res}                       (0.50)          (2.01)          (1.42)   {txt}
{txt}agesq               {res}                                       -0.060                   {txt}
                    {res}                                       (0.69)                   {txt}
{txt}over21=0 # agesq    {res}                                        0.000                   {txt}
                    {res}                                          (.)                   {txt}
{txt}over21=1 # agesq    {res}                                        1.050                   {txt}
                    {res}                                       (0.99)                   {txt}
{txt}_cons               {res}       20.089***       20.107***       20.068***       19.574***{txt}
                    {res}       (0.27)          (0.32)          (0.49)          (0.44)   {txt}
{txt}{hline 84}
{txt}Adj. R-Squared      {res}        0.790           0.786           0.785           0.420   {txt}
{txt}R-Squared           {res}        0.799           0.799           0.808           0.496   {txt}
{txt}Observations        {res}       48.000          48.000          48.000          24.000   {txt}
{txt}{hline 84}
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/francisco/Documents/umich/coursework/semester_2/pubpol_639/assignments/ps6/ps6.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}19 Apr 2024, 21:53:46
{txt}{.-}
{smcl}
{txt}{sf}{ul off}