{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/home/francisco/Documents/umich/coursework/semester_2/pubpol_639/assignments/ps5/ps5.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Apr 2024, 23:30:17
{txt}
{com}. //_1
. display c(current_date)
{res} 5 Apr 2024
{txt}
{com}. //_2
. use drunkdri.dta, clear
{txt}
{com}. twoway scatter vfrall beertax if year == 1988
{res}{txt}
{com}. graph export vfr_beer.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
vfr_beer.png{rm}
saved as
PNG
format
{p_end}

{com}. //_3
. qui reg vfrall beertax mlda if year == 1988, robust
{txt}
{com}. eststo raw, title(Reg. 1)
{txt}
{com}. qui reg vfrall beertax mlda dry vmiles yngdrv perinc if year == 1988, robust
{txt}
{com}. eststo stuff, title(Reg. 2)
{txt}
{com}. estout raw stuff, cells(b (star fmt(3)) se(par fmt(2))) starlevels(* 0.10 ** 0.05 *** 0.01) legend stats(r2_a r2 N, labels("Adj. R-Squared" "R-Squared" "Observations")) label collabels("") 
{res}
{txt}{hline 52}
{txt}                           Reg. 1          Reg. 2   
{txt}                                                    
{txt}{hline 52}
{txt}Tax on Case of Beer {res}        0.508***        0.141   {txt}
                    {res}       (0.12)          (0.14)   {txt}
{txt}Minimum Legal Drin~e{res}       -0.945***       -0.345** {txt}
                    {res}       (0.07)          (0.13)   {txt}
{txt}% Residing in Dry ~s{res}                        0.004   {txt}
                    {res}                       (0.00)   {txt}
{txt}Ave. Mile per Driver{res}                        0.000***{txt}
                    {res}                       (0.00)   {txt}
{txt}% of Drivers Aged~24{res}                        0.869   {txt}
                    {res}                       (2.78)   {txt}
{txt}Per Capita Persona~e{res}                       -0.000***{txt}
                    {res}                       (0.00)   {txt}
{txt}_cons               {res}       21.645***        8.454** {txt}
                    {res}       (1.27)          (3.16)   {txt}
{txt}{hline 52}
{txt}Adj. R-Squared      {res}        0.253           0.546   {txt}
{txt}R-Squared           {res}        0.285           0.604   {txt}
{txt}Observations        {res}       48.000          48.000   {txt}
{txt}{hline 52}
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}.  
. //_4
. gen y83 = (year == 1983) 
{txt}
{com}. gen y84 = (year == 1984)
{txt}
{com}. gen y85 = (year == 1985)
{txt}
{com}. gen y86 = (year == 1986)
{txt}
{com}. gen y87 = (year == 1987)
{txt}
{com}. gen y88 = (year == 1988)
{txt}
{com}. 
. qui reg vfrall beertax mlda dry vmiles yngdrv perinc, robust
{txt}
{com}. eststo col1, title(Reg. 3)
{txt}
{com}. qui reg vfrall beertax mlda dry vmiles yngdrv perinc y83-y88, robust
{txt}
{com}. eststo col2, title(Reg. 4)
{txt}
{com}. qui reg vfrall beertax mlda dry vmiles yngdrv perinc y83-y88, absorb(state) robust
{txt}
{com}. eststo col3, title(Reg. 5)
{txt}
{com}. estout col1 col2 col3, cells(b (star fmt(3)) se(par fmt(2))) starlevels(* 0.10 ** 0.05 *** 0.01) legend stats(r2_a r2 N, labels("Adj. R-Squared" "R-Squared" "Observations")) label collabels("") 
{res}
{txt}{hline 68}
{txt}                           Reg. 3          Reg. 4          Reg. 5   
{txt}                                                                    
{txt}{hline 68}
{txt}Tax on Case of Beer {res}        0.095           0.083          -0.571** {txt}
                    {res}       (0.07)          (0.06)          (0.26)   {txt}
{txt}Minimum Legal Drin~e{res}       -0.008          -0.028           0.004   {txt}
                    {res}       (0.03)          (0.03)          (0.02)   {txt}
{txt}% Residing in Dry ~s{res}       -0.000          -0.000           0.020** {txt}
                    {res}       (0.00)          (0.00)          (0.01)   {txt}
{txt}Ave. Mile per Driver{res}        0.000*          0.000           0.000   {txt}
                    {res}       (0.00)          (0.00)          (0.00)   {txt}
{txt}% of Drivers Aged~24{res}        0.650           2.043           0.731   {txt}
                    {res}       (1.31)          (1.24)          (1.03)   {txt}
{txt}Per Capita Persona~e{res}       -0.000***       -0.000***        0.000***{txt}
                    {res}       (0.00)          (0.00)          (0.00)   {txt}
{txt}y83                 {res}                       -0.074          -0.092** {txt}
                    {res}                       (0.11)          (0.05)   {txt}
{txt}y84                 {res}                       -0.068          -0.153***{txt}
                    {res}                       (0.11)          (0.05)   {txt}
{txt}y85                 {res}                       -0.036          -0.233***{txt}
                    {res}                       (0.12)          (0.06)   {txt}
{txt}y86                 {res}                        0.085          -0.196** {txt}
                    {res}                       (0.14)          (0.08)   {txt}
{txt}y87                 {res}                        0.106          -0.260***{txt}
                    {res}                       (0.16)          (0.10)   {txt}
{txt}y88                 {res}                        0.135          -0.306***{txt}
                    {res}                       (0.18)          (0.11)   {txt}
{txt}_cons               {res}        2.445***        2.680***        0.103   {txt}
                    {res}       (0.78)          (0.80)          (0.62)   {txt}
{txt}{hline 68}
{txt}Adj. R-Squared      {res}        0.372           0.374           0.909   {txt}
{txt}R-Squared           {res}        0.383           0.396           0.925   {txt}
{txt}Observations        {res}      336.000         336.000         336.000   {txt}
{txt}{hline 68}
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}.  
. //_5
. qui reg vfrall beertax mlda dry vmiles yngdrv perinc y83-y88, robust
{txt}
{com}. test  y83 y84 y85 y86 y87 y88

{p 0 7}{space 1}{text:( 1)}{space 1} {res}y83 = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} y84 = 0{p_end}
{p 0 7}{space 1}{text:( 3)}{space 1} y85 = 0{p_end}
{p 0 7}{space 1}{text:( 4)}{space 1} y86 = 0{p_end}
{p 0 7}{space 1}{text:( 5)}{space 1} y87 = 0{p_end}
{p 0 7}{space 1}{text:( 6)}{space 1} y88 = 0{p_end}

{txt}       F(  6,   323) ={res}    0.64
{txt}{col 13}Prob > F ={res}    0.6960
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/home/francisco/Documents/umich/coursework/semester_2/pubpol_639/assignments/ps5/ps5.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 5 Apr 2024, 23:30:17
{txt}{.-}
{smcl}
{txt}{sf}{ul off}